<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"7315d26182c51d217d9e3d344cc810f7b40da8efea2eba56753ce5cdf71bad9f","backend":"fa62173345e78c9fecfdbf3e4ef8afdf1df0ca95938bc4dbb2954d83ae5001cc","plan_job_ref":"Job Test plan target and replace #319 at https://github.com/dflook/terraform-github-actions/actions/runs/4293606072","plan_hash":"db1377d2f6d57d80b7998172f9c88a7437fc10f4de2d1172b37dc5bf774dcd9b","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan in __tests/workflows/test-target-replace__
:skull: Planning to destroy all resources
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "AtuiZYsasH" -> (known after apply)
  ~ foreach = "uWA3Rfk7kA" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #319](https://github.com/dflook/terraform-github-actions/actions/runs/4293606072)